snlkuharlocal/src/Documents/ЛистМаркировкиОстатков/ЛистМаркировкиОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЛистМаркировкиОстатков</name>
  <basedOn>Document.ЗаданиеНаМаркировку</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодКоробки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихкодКоробки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОшибки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПолный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фАгрегироватьКоробки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фАгрегироватьБлочки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоБлочков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыАктуализированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ЗаданиеНаМаркировку/ЗаданиеНаМаркировку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданиеНаМаркировку</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <registerRecords>InformationRegister.РезервыКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>InformationRegister.ИспользованныеКодыАгрегаций</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <registerRecords>InformationRegister.ОшибкиПолученияКМ</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемаркировка</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>СформированыАгрегации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>фУпрощенныйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фАгрегироватьБлочки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фАгрегироватьКоробки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фАгрегироватьПалеты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоБлочков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШтукВБлочке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШтукВКоробке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШтукНаПалете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыАктуализированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗабронированоКМ_Штука</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗабронированоКМ_Блочок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗабронированоКМ_Коробка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодБлочка</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодПалеты</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛистМаркировки</name>
      <type>
        <types>DocumentRef.ЛистМаркировкиОстатков</types>
      </type>
    </attributes>
    <attributes>
      <name>Распечатан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Нанесен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерБлочка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерКоробки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПалеты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаБронированияКМ</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыКоробок</name>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.ЛистМаркировки</types>
        <types>DocumentRef.ЛистМаркировкиОстатков</types>
        <types>DocumentRef.ЛистПереукладки</types>
        <types>DocumentRef.ЛистНабора</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ЛистМаркировки/ЛистМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЛистМаркировки</name>
  <basedOn>Document.ЗаданиеНаМаркировку</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛистНабора</name>
    <type>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОклейкаНеВыполнялась</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоНаборы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковокРаспечатанная</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПечати</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ЛистМаркировкиОстатков/Forms/ФормаДокумента/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеВидимостью();
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ОжидаемыйРезультат	= ПолучитьОжидания();	
		КоробкаПлан 		= ОжидаемыйРезультат.ШтрихКодКоробки;
		
		Если Объект.ШтрихкодыУпаковок.Количество()>0 Тогда
			ПроверитьРезультатыСканирования_НаСервере();		
		КонецЕсли;
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Объект.ДокОснование) Тогда
		ПоказатьПредупреждение(, "Не указан документ основание !");
		Отказ = Истина;
		Возврат;	
	КонецЕсли;
	
	УправлениеВидимостью();
	
	ЭтаФорма.ЗаблокироватьДанныеФормыДляРедактирования();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)	
	Если Объект.Отменен И Объект.ШтрихкодыУпаковок.Количество()>0 Тогда
		ПоказатьПредупреждение(, "Отменить можно только полностью пустой лист маркировки ! Очистите таблицу кодов и повторите операцию !");		
		Отказ = Истина;
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ПолучитьОжидания()
	Результат = Новый Структура("ШтрихКодКоробки,ШтрихКодыУпаковок", Неопределено, Новый Соответствие);
	
	Запрос = Новый Запрос;
	Запрос.Текст ="
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки,
	|	ШтрихкодКоробки
	|ИЗ
	|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка 				= &ЗаданиеНаМаркировку
	|	И ЛистМаркировки	= &ЛистМаркировки
	|ИТОГИ ПО
	|	ШтрихкодКоробки
	|";
	
	Запрос.УстановитьПараметр("ЗаданиеНаМаркировку",	Объект.ДокОснование);
	Запрос.УстановитьПараметр("ЛистМаркировки", 		Объект.Ссылка);
	
	Выборка_ШтрихкодКоробки = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ШтрихкодКоробки");
	Пока Выборка_ШтрихкодКоробки.Следующий() Цикл
		Результат.ШтрихКодКоробки = Выборка_ШтрихкодКоробки.ШтрихКодКоробки;
		Выборка = Выборка_ШтрихкодКоробки.Выбрать();
		Пока Выборка.Следующий() Цикл
			Результат.ШтрихКодыУпаковок[Выборка.ШтрихкодУпаковки] =  Истина;
		КонецЦикла; 
	КонецЦикла;
	
	Возврат Результат;
КонецФункции //ПолучитьОжидания()

&НаСервере
Функция ВнешнееСобытиеНаСервере(Данные)
	
	Если Объект.Ссылка = Документы.ЛистМаркировки.ПустаяСсылка() тогда
		Записать();
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если ТолькоПросмотр Тогда Возврат КонецЕсли;	
	Если НЕ ВводДоступен() Тогда Возврат КонецЕсли; 
	
	Если НЕ ЭтоСобытиеСканера(Событие) Тогда Возврат КонецЕсли;
	
	Данные = Лев(СтрЗаменить(Данные, Символы.ПС, ""), 31);
	
	глТорговоеОборудование.СканерПосылкаДанных(1);
	глСобытиеСканераОтработано = Истина;
	
	Элементы.мСообщение.ЦветТекста = WebЦвета.Черный;
	
	Если СтрДлина(Данные) < 20 Тогда
		Сообщить("В данном документе разрешено сканировать только коробки ЧЗ и штуки ЧЗ !", СтатусСообщения.Важное);
		
		мСообщение = "Недопустимая длина кода: "+СтрДлина(Данные)+" !!!";
		Элементы.мСообщение.ЦветТекста = WebЦвета.Красный;
		
		МаркировкаК.ВоспроизвестиЗвукОшибки();
	ИначеЕсли СтрДлина(Данные) = 20 Тогда		
		Если ДобавитьКА_НаСервере(Сред(Данные,3)) Тогда //Коробка - надо заканчивать
			рПроверки = ПроверитьРезультатыСканирования_НаСервере();			
			Если рПроверки.Успешно Тогда
			Иначе
				МаркировкаК.ВоспроизвестиЗвукОшибки();
			КонецЕсли; 
		Иначе
			МаркировкаК.ВоспроизвестиЗвукОшибки();			
		КонецЕсли; 
	Иначе
		рДобавления = ДобавитьКМ_НаСервере(Данные);
		Если рДобавления.Успешно Тогда
		Иначе
			МаркировкаК.ВоспроизвестиЗвукОшибки();
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьКА_НаСервере(ДанныеКМ)
	Успешно 		    = Истина;
	ШтрихкодУпаковки	= Справочники.ШтрихкодыУпаковокТоваров.НайтиПоНаименованию(ДанныеКМ, Истина);
	
	Если ШтрихкодУпаковки.Пустая() Тогда
		мСообщение = "Не найден КМ: " + ДанныеКМ + " !!!";
		Элементы.мСообщение.ЦветТекста = WebЦвета.Красный;
		Успешно 		    = Ложь;		
	Иначе
		рПроверки = РеквизитФормыВЗначение("Объект").ШтрихКодКоробкиУникален(ШтрихкодУпаковки);
		Если рПроверки.Успешно Тогда
			Объект.ШтрихкодКоробки = ШтрихкодУпаковки;
			Записать();
		Иначе
			мСообщение = СтрСоединить(рПроверки.Ошибки, Символы.ПС);
			Элементы.мСообщение.ЦветТекста = WebЦвета.Красный;
			Успешно    = Ложь;
		КонецЕсли;
	КонецЕсли; 
	
	Возврат Успешно;
КонецФункции //ДобавитьКА_НаСервере()

&НаСервере
Функция ДобавитьКМ_НаСервере(ДанныеКМ)
	Результат 			= МаркировкаКС.СтруктураРезультата();
	
	ШтрихкодУпаковки	= Справочники.ШтрихкодыУпаковокТоваров.НайтиПоНаименованию(ДанныеКМ, Истина);
	
	Если ШтрихкодУпаковки.Пустая() Тогда
		мСообщение = "Не найден КМ: " + ДанныеКМ + " !!!";
		Элементы.мСообщение.ЦветТекста = WebЦвета.Красный;
		
		Результат.Ошибки.Добавить(мСообщение); 
		Результат.Успешно = Ложь;
	Иначе
		Если фСканироватьВМинус Тогда
			Для Каждого СтрокаКМ Из Объект.ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("ШтрихкодУпаковки", ШтрихкодУпаковки)) Цикл
				Объект.ШтрихкодыУпаковок.Удалить(СтрокаКМ);
				Прервать;
				Модифицированность = Истина;
			КонецЦикла;
		Иначе			
			Если фУпрощенныйРежим Тогда
				Если ЭтоПервыйКодЛенты(ШтрихКодУпаковки) Тогда
					Для Каждого ШтрихКодУпаковки Из ПолучитьВсеШКЛенты() Цикл
						СтрокаТЧ = Объект.ШтрихкодыУпаковок.Добавить();		
						СтрокаТЧ.ШтрихкодУпаковки = ШтрихкодУпаковки;
					КонецЦикла; 
					
					Модифицированность = Истина;
				Иначе
					мСообщение = "КМ: " + ШтрихКодУпаковки + " не первый в ленте !!!";
					Элементы.мСообщение.ЦветТекста = WebЦвета.Красный;
					
					Результат.Ошибки.Добавить(мСообщение); 
					Результат.Успешно = Ложь;					
				КонецЕсли;
			Иначе
				СтрокаТЧ = Объект.ШтрихкодыУпаковок.Добавить();		
				СтрокаТЧ.ШтрихкодУпаковки = ШтрихкодУпаковки;			
				
				Модифицированность = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	КоличествоКМ = Объект.ШтрихкодыУпаковок.Количество();
	
	Возврат Результат;
КонецФункции //ДобавитьКМ_НаСервере()

&НаСервере
Функция ЭтоПервыйКодЛенты(ШтрихКодУпаковки)
	Результат = Ложь;
	
	Если НЕ ЗначениеЗаполнено(ШтрихКодУпаковки) Тогда
		Возврат Результат;	
	КонецЕсли;
	
	Запрос=Новый ("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтрихкодУпаковки
	|ИЗ
	|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка 				= &ЗаданиеНаМаркировку
	|	И ЛистМаркировки 	= &ЛистМаркировки
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|";	
	
	Запрос.УстановитьПараметр("ЗаданиеНаМаркировку",	Объект.ДокОснование);
	Запрос.УстановитьПараметр("ЛистМаркировки",			Объект.Ссылка);	
	
	Выборка		= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.ШтрихКодУпаковки = ШтрихКодУпаковки Тогда
			Результат = Истина;					
		КонецЕсли;	
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ЭтоПервыйКодЛенты(ШтрихКодУпаковки) 

&НаСервере
Функция ПолучитьВсеШКЛенты()
	Запрос = Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки
	|ИЗ
	|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка 				= &ЗаданиеНаМаркировку
	|	И ЛистМаркировки 	= &ЛистМаркировки
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|";	
	
	Запрос.УстановитьПараметр("ЗаданиеНаМаркировку",	Объект.ДокОснование);
	Запрос.УстановитьПараметр("ЛистМаркировки",			Объект.Ссылка);	
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШтрихкодУпаковки");	
КонецФункции //ПолучитьВсеШКЛенты() 

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
КонецПроцедуры
  
&НаСервере
Процедура УправлениеВидимостью()
	КоличествоКМ	= Объект.ШтрихкодыУпаковок.Количество();
	
	ТолькоПросмотр 	= ТолькоПросмотр ИЛИ (Объект.Завершен ИЛИ Объект.Отменен);	
	
	Элементы.ШтрихкодыУпаковокШтрихкодКоробки.Видимость = Объект.фАгрегироватьБлочки;
	Элементы.гКоробка.Видимость = (Объект.фАгрегироватьКоробки И Объект.НеПолный = Ложь);
	
	// Кухарь А.Ю.  12.11.2024 начало
	//Если РольДоступна("Администратор") Тогда
	Если РольДоступна("ОператорЧЗ") Тогда
		// Кухарь А.Ю.  12.11.2024 конец
		
		ТолькоПросмотр = Ложь;
		
		Элементы.кнОтменить.Доступность = Истина;
		Элементы.ШтрихкодыУпаковок.ТолькоПросмотр = Ложь;
	КонецЕсли; 
	
	Если Объект.Завершен ИЛИ Объект.Отменен Тогда
		Элементы.фУпрощенныйРежим.Доступность	= Ложь;
		Элементы.кнОтменить.Доступность 		= Ложь;
		Элементы.кнЗакрытьКоробку.Доступность	= Ложь;	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ОтобразитьОшибкиКМ(рПроверки)
	ОтобразитьОшибкуКМ(рПроверки.Дубли,		"Дубль");
	ОтобразитьОшибкуКМ(рПроверки.Лишние,	"Лишний");
		
	Для Каждого КиЗ Из рПроверки.Недостающие Цикл
		СтрокаН = НедостающиеКМ.Добавить();			
		СтрокаН.ШтрихкодУпаковки = КиЗ.Ключ;
	КонецЦикла;
	Элементы.НедостающиеКМ.Видимость = (НедостающиеКМ.Количество()>0);
КонецПроцедуры

&НаСервере
Процедура ОтобразитьОшибкуКМ(СписокКМ, Текст)
	Для Каждого КиЗ Из СписокКМ Цикл		
		ШтрихкодУпаковки = КиЗ.Ключ;
		Для Каждого Строка Из Объект.ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("ШтрихкодУпаковки", ШтрихкодУпаковки)) Цикл
			Строка.Ошибка = СокрЛП(Строка.Ошибка+" "+Текст);
		КонецЦикла; 
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция СравнитьРезультатыСканирования()
	Результат	= Новый Структура("Успешно,Ошибки", Истина, Новый Массив);
	ОшибкиКМ	= Новый Структура("Дубли,Лишние,Недостающие", Новый Соответствие, Новый Соответствие, Новый Соответствие);
	
	Запрос = Новый Запрос;	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки,
	|	ШтрихкодКоробки
	|ПОМЕСТИТЬ ВТ_Лента
	|ИЗ
	|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка				= &ЗаданиеНаМаркировку
	|	И ЛистМаркировки	= &ЛистМаркировки
	|;
	|ВЫБРАТЬ	
	|	ШтрихкодУпаковки,
	|	Ссылка.ШтрихкодКоробки КАК ШтрихкодКоробки
	|ПОМЕСТИТЬ ВТ_ЛистМаркировки
	|ИЗ
	|	Документ.ЛистМаркировкиОстатков.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка = &ЛистМаркировки
	|	И ШтрихкодУпаковки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|;
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки,
	|	СУММА(1) КАК КолДублей
	|ИЗ 
	|	ВТ_ЛистМаркировки
	|СГРУППИРОВАТЬ ПО
	|	ШтрихкодУпаковки
	|ИМЕЮЩИЕ 
	|	СУММА(1)>1
	|";
	
	Запрос.УстановитьПараметр("ЗаданиеНаМаркировку",	Объект.ДокОснование);
	Запрос.УстановитьПараметр("ЛистМаркировки", 		Объект.Ссылка);
	
	//Дубли
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		ОшибкиКМ.Дубли[Выборка.ШтрихкодУпаковки] = Истина;
	КонецЦикла;
	
	//ШК коробки
	Если Объект.ШтрихкодКоробки.Пустая() Тогда
		Если Объект.НеПолный Тогда
			Объект.ШтрихкодКоробки = КоробкаПлан;			
		Иначе			
			Результат.Ошибки.Добавить("Не сосканирована коробка !");
		КонецЕсли;
	Иначе
		Если Объект.ШтрихкодКоробки <> КоробкаПлан Тогда
			Результат.Ошибки.Добавить("Неверный номер коробки !");		
		КонецЕсли;
	КонецЕсли;
	
	//Соответствие ленте
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВТ_Лента.ШтрихкодУпаковки 			КАК КМ_Лента,
	|	ВТ_ЛистМаркировки.ШтрихкодУпаковки	КАК КМ_ЛистМаркировки
	|ИЗ
	|	ВТ_Лента
	|ПОЛНОЕ СОЕДИНЕНИЕ
	|	ВТ_ЛистМаркировки
	|ПО
	|	ВТ_Лента.ШтрихкодУпаковки = ВТ_ЛистМаркировки.ШтрихкодУпаковки
	|ГДЕ
	|	ВТ_Лента.ШтрихкодУпаковки ЕСТЬ NULL
	|	ИЛИ ВТ_ЛистМаркировки.ШтрихкодУпаковки ЕСТЬ NULL
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.КМ_Лента = NULL Тогда
			ОшибкиКМ.Лишние[Выборка.КМ_ЛистМаркировки] = Истина;
		КонецЕсли;
		Если Выборка.КМ_ЛистМаркировки = NULL И Объект.НеПолный = Ложь Тогда
			ОшибкиКМ.Недостающие[Выборка.КМ_Лента] = Истина;
		КонецЕсли;	
	КонецЦикла;
	
	Результат.Вставить("ОшибкиКМ", ОшибкиКМ);
	
	Если Объект.ШтрихкодыУпаковок.Количество() > 0 Тогда	
		Если (ОшибкиКМ.Дубли.Количество() + ОшибкиКМ.Лишние.Количество() + ОшибкиКМ.Недостающие.Количество()) > 0 Тогда
			Результат.Ошибки.Добавить("Ошибки сканирования КМ");
			Если ОшибкиКМ.Дубли.Количество() > 0 Тогда
				Результат.Ошибки.Добавить("	дублированы КМ");			
			КонецЕсли; 
			Если ОшибкиКМ.Лишние.Количество() > 0 Тогда
				Результат.Ошибки.Добавить("	лишние КМ");			
			КонецЕсли;
			Если ОшибкиКМ.Недостающие.Количество() > 0 Тогда
				Результат.Ошибки.Добавить("	не сосканировано: " + ОшибкиКМ.Недостающие.Количество()+" КМ");
			КонецЕсли;
		КонецЕсли;
	Иначе		
		Результат.Ошибки.Добавить("Нет ни одного КМ");
	КонецЕсли;	
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);			
	
	Возврат Результат;
КонецФункции //ВыполнитьПроверкуРезультатовСканирования()

&НаСервере
Функция ПроверитьРезультатыСканирования_НаСервере(СтавитьФлагОшибки = Ложь)
	Если Модифицированность Тогда
		Записать();	
	КонецЕсли;
	
	рПроверки 	= СравнитьРезультатыСканирования();
	ПоказатьОшибки(рПроверки);
	
	Если СтавитьФлагОшибки Тогда
		Объект.ЕстьОшибки = НЕ рПроверки.Успешно;		
		Модифицированность = Истина;
	КонецЕсли;
	
	Возврат рПроверки;
КонецФункции //ПроверитьЛМО_НаСервере()

&НаКлиенте
Процедура ПроверитьРезультатыСканирования(Команда = Неопределено)
	рПроверки = ПроверитьРезультатыСканирования_НаСервере(Истина);	
КонецПроцедуры
 
&НаСервере
Процедура ПоказатьОшибки(рПроверки)
	НедостающиеКМ.Очистить();
	Элементы.НедостающиеКМ.Видимость = Ложь;
	
	Для каждого СтрокаТЧ Из Объект.ШтрихкодыУпаковок Цикл
		СтрокаТЧ.Ошибка = "";	
	КонецЦикла; 
	
	Для Каждого СтрокаКМ Из Объект.ШтрихкодыУпаковок Цикл
		СтрокаКМ.Ошибка = "";	
	КонецЦикла;
	
	Если рПроверки.Успешно Тогда
		мСообщение = "Коробка собрана корректно.";
		Элементы.мСообщение.ЦветТекста = WebЦвета.ТемноЗеленый;
		Элементы.ШтрихкодыУпаковок.ЦветТекстаЗаголовка = WebЦвета.ТемноЗеленый;
	Иначе
		Элементы.ШтрихкодыУпаковок.ЦветТекстаЗаголовка = WebЦвета.Красный;
		ОтобразитьОшибкиКМ(рПроверки.ОшибкиКМ);
		
		мСообщение = СтрСоединить(рПроверки.Ошибки, Символы.ПС);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьКоробку(Команда)
	рПроверки = ПроверитьРезультатыСканирования_НаСервере(Истина);
	
	Если Объект.ЕстьОшибки Тогда
		ПоказатьПредупреждение(, "Обнаружены ошибки сканирования ! Закрыть коробку невозможно !");
	Иначе
		Объект.Завершен = Истина;
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
		Закрыть();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодыУпаковок_Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ВыбраннаяСтрока<>Неопределено Тогда
		ПоказатьЗначение(, Объект.ШтрихкодыУпаковок.НайтиПоИдентификатору(ВыбраннаяСтрока).ШтрихкодУпаковки);	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ВвестиКодРуками(Команда)
	ЗначениеКода = "";
	Если ВвестиСтроку(ЗначениеКода) Тогда
		ВнешнееСобытие("", "BarCodeValue", ЗначениеКода);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)	
	Объект.Отменен 	= Истина;
	Объект.НеПолный = Ложь;
	
	Объект.ШтрихкодКоробки = Неопределено;
	Объект.ШтрихкодыУпаковок.Очистить();
	
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
КонецПроцедуры


&НаКлиенте
Процедура НеПолный_ПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры
